org/2023-06-16-MagitTips.org
#+OPTIONS: toc:nil
#+BEGIN_EXPORT html
---
layout: default
title: Magit Tips
subtitle: Tips and tricks for troubleshooting magit, a spacemacs git porcelain
---
#+END_EXPORT
* Magit Tips
** Creating Branches
An extremely annoying error while learning magit branch workflows is the following:

#+BEGIN_SRC
Not a valid starting-point: <my_branch>
#+END_SRC

Where does this come from, and how do we resolve it?

Recall that to check out a branch from magit, after navigating to the magit-status page, we press ~b n~

Then, magit will ask you for your starting place. Be careful: magit is NOT asking you to name your new branch yet. This is actually very helpful - we frequently want to create a branch not from master, but from some other existing branch. But here in lies the issue. It's asking for the starting place. 

So -- choose a branch that exists! THEN magit will ask you to name your new branch.
