_posts/2023-06-16-MagitTips.html
---
layout: default
title: Magit Tips
subtitle: Tips and tricks for troubleshooting magit, a spacemacs git porcelain
---
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9b621c7">1. Magit Tips</a>
<ul>
<li><a href="#org4104e29">1.1. Creating Branches</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9b621c7" class="outline-2">
<h2 id="org9b621c7"><span class="section-number-2">1.</span> Magit Tips</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org4104e29" class="outline-3">
<h3 id="org4104e29"><span class="section-number-3">1.1.</span> Creating Branches</h3>
<div class="outline-text-3" id="text-1-1">
<p>
An extremely annoying error while learning magit branch workflows is the following:
</p>

<pre class="example">
Not a valid starting-point: &lt;my_branch&gt;
</pre>

<p>
Where does this come from, and how do we resolve it?
</p>

<p>
Recall that to check out a branch from magit, after navigating to the magit-status page, we press <code>b n</code>
</p>

<p>
Then, magit will ask you for your starting place. Be careful: magit is NOT asking you to name your new branch yet. This is actually very helpful - we frequently want to create a branch not from master, but from some other existing branch. But here in lies the issue. It's asking for the starting place. 
</p>

<p>
So &#x2013; choose a branch that exists! THEN magit will ask you to name your new branch.
</p>
</div>
</div>
</div>
